Revit 2025 API
RailingPlacementPosition Enumeration
 Railing placement position.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RailingPlacementPosition
Public Enumeration RailingPlacementPosition
public enum class RailingPlacementPosition
type RailingPlacementPosition
Members
Member name | Value | Description
Treads | 0 |  Places railing on treads.
Stringer | 1 |  Places railing on stringer.
Undefined | -1 |  No railing placement.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace